Revit 2027 API
FormatOptions.UseDefault Property
 Indicates whether default or custom formatting should be used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UseDefault { get; set; }
Public Property UseDefault As Boolean
	Get
	Set
public:
property bool UseDefault {
	bool get ();
	void set (bool value);
}
member UseDefault : bool with get, set
Property Value
Boolean
 True if default formatting should be used; false if custom formatting should be used.
Remarks
 If UseDefault is true, formatting will be according to the default settings in the Units class, and none of the other settings in the object are meaningful. If UseDefault is false, the object contains custom settings that override the default settings in the Units class. UseDefault is always false for FormatOptions objects in the Units class.
See Also
Reference
FormatOptions Class
Autodesk.Revit.DB Namespace